app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 0]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      #binding.pry
      if @artist = Artist.find_by(id: params[:artist_id])
        if @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
---
  def show
    if params[:artist_id]
      if @artist = Artist.find_by(id: params[:artist_id])
        if @song = Song.find_by(id: params[:id])