app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
---
  def index
    if params[:artist_id]
      binding.pry
      if Artist.find(params[:artist_id]).songs